# gateway-api - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda.data.archive_file.default: Read complete after 0s [id=8061f82e9c14855f7b0fe0ae97cc1e6cee9c915c]
module.common_resources.module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-gateway_api]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=ey1zxxabnk]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_secrets_policy_document: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/gateway_api]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_secrets_policy_document: Read complete after 0s [id=2120787267]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-gateway_api-20230515113049810000000001]
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/gateway_api]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=kznz68t1xg]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=h7ze4cak14]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=0fdx5kou2j]
module.common_resources.module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=gateway_api]
module.common_resources.module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=cgb14nl]
module.common_resources.module.aws_api_gateway.aws_apigatewayv2_route.any["all"]: Refreshing state... [id=a3p7ag2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be destroyed
  # (because aws_iam_role.default is not in configuration)
  - resource "aws_iam_role" "default" {
      - arn                   = "arn:aws:iam::064003852748:role/lambda-execution-gateway_api" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-05-15T11:30:49Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-execution-gateway_api" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-execution-gateway_api" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = ""
              - region         = ""
            },
        ] -> null
      - tags                  = {
          - "domain"        = "gateway"
          - "environment"   = "production"
          - "resource"      = "gateway-api"
          - "resource_type" = "lambda"
        } -> null
      - tags_all              = {
          - "domain"        = "gateway"
          - "environment"   = "production"
          - "resource"      = "gateway-api"
          - "resource_type" = "lambda"
        } -> null
      - unique_id             = "AROAQ5ZXNJHGETODBN2C5" -> null
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-gateway_api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "gateway"
          + "environment"   = "production"
          + "resource"      = "gateway-api"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy.lambda_secrets_policy will be created
  + resource "aws_iam_role_policy" "lambda_secrets_policy" {
      + id     = (known after apply)
      + name   = "lambda-secrets-policy-gateway_api"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action = "secretsmanager:GetSecretValue"
                      + Effect = "Allow"
                      + Sid    = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "gateway_api"
      ~ role                           = "arn:aws:iam::064003852748:role/lambda-execution-gateway_api" -> (known after apply)
        tags                           = {
            "domain"        = "gateway"
            "environment"   = "production"
            "resource"      = "gateway-api"
            "resource_type" = "lambda"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*